In [2]:
# Import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# Load datasets
df1 = pd.read_csv("Batch 1.csv")
df2 = pd.read_csv("Batch 2.csv")
df3 = pd.read_csv("Batch 3.csv")
df4 = pd.read_csv("Batch 4.csv")

#Combine datasets
df = pd.concat([df1, df2, df3, df4], ignore_index=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1861108 entries, 0 to 1861107
Data columns (total 6 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   state         object
 2   district      object
 3   pincode       int64
 4   bio_age_5_17  int64
 5   bio_age_17_   int64
dtypes: int64(3), object(3)
memory usage: 85.2+ MB

In [34]:
# Add relevant features
df["total"] = df["bio_age_5_17"] + df["bio_age_17_"]
df['date'] = pd.to_datetime(df['date'], format='%d-%m-%Y', errors='coerce')
df['date'].dt.month.value_counts().sort_index()

date
3      21953
4      21603
5      21987
6      21991
7      22169
9     416846
10    331715
11    459086
12    543758
Name: count, dtype: int64

In [5]:
# State Name Normalization and Aggregation
df['state'] = (
    df['state']
      .astype(str)
      .str.strip()
      .str.lower()
      .str.replace(r'\s+', ' ', regex=True)
)

df['district'] = (
    df['district']
      .astype(str)
      .str.strip()
      .str.lower()
      .str.replace(r'\s+', ' ', regex=True)
)

state_mapping = {
    # West Bengal
    'west bangal': 'west bengal',
    'westbengal': 'west bengal',

    # Odisha
    'orissa': 'odisha',

    # Andhra Pradesh
    'andhra pradesh': 'andhra pradesh',

    # Chhattisgarh
    'chhatisgarh': 'chhattisgarh',

    # Tamil Nadu
    'tamilnadu': 'tamil nadu',

    # Uttarakhand
    'uttaranchal': 'uttarakhand',

    # Jammu & Kashmir
    'jammu & kashmir': 'jammu and kashmir',

    # Andaman & Nicobar
    'andaman & nicobar islands': 'andaman and nicobar islands',

    # Puducherry
    'pondicherry': 'puducherry',

    # Dadra & Nagar Haveli + Daman & Diu
    'dadra & nagar haveli': 'dadra and nagar haveli and daman and diu',
    'daman & diu': 'dadra and nagar haveli and daman and diu',
    'dadra and nagar haveli': 'dadra and nagar haveli and daman and diu',
    'daman and diu': 'dadra and nagar haveli and daman and diu'
}

df['state'] = df['state'].replace(state_mapping)

In [6]:
# Analyse date granularity of data
print("\nNumber of unique dates:\n" + str(df['date'].nunique()))
print("The date range is from " + str(df['date'].min()) + " to " + str(df['date'].max()))

Number of unique dates:
89
The date range is from 2025-03-01 00:00:00 to 2025-12-29 00:00:00

In [7]:
#doing the same thing for enrollments data
a = pd.read_csv("enrollment1.csv")
b = pd.read_csv("enrollment2.csv")
data_enrollment = pd.concat([a, b], ignore_index=True)

In [9]:
df_demo = pd.read_csv("df_demo.csv")

In [31]:
# Add relevant features
df_demo["total"] = df_demo["demo_age_5_17"] + df_demo["demo_age_17_"]
df['date'] = pd.to_datetime(df['date'], format='%d-%m-%Y', errors='coerce')
df['date'].dt.month.value_counts().sort_index()

date
3      21953
4      21603
5      21987
6      21991
7      22169
9     416846
10    331715
11    459086
12    543758
Name: count, dtype: int64

In [32]:
df_demo

,date,state,district,pincode,demo_age_5_17,demo_age_17_,total,total2,total3,demo_total
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,578,49,578,578
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,397,22,397,397
2,01-03-2025,Gujarat,Rajkot,360006,65,765,830,65,830,830
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,338,24,338,338
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,830,45,830,830
...,...,...,...,...,...,...,...,...,...,...
2071693,29-12-2025,West Bengal,West Midnapore,721212,0,12,12,0,12,12
2071694,29-12-2025,West Bengal,West Midnapore,721420,0,1,1,0,1,1
2071695,29-12-2025,West Bengal,West Midnapore,721424,0,5,5,0,5,5
2071696,29-12-2025,West Bengal,West Midnapore,721426,0,3,3,0,3,3
2071697,29-12-2025,West Bengal,hooghly,712701,0,1,1,0,1,1

In [33]:
data_enrollment

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,total
0,26-10-2025,Andhra Pradesh,Nalgonda,508004,0,1,0,1
1,26-10-2025,Andhra Pradesh,Nalgonda,508238,1,0,0,1
2,26-10-2025,Andhra Pradesh,Nalgonda,508278,1,0,0,1
3,26-10-2025,Andhra Pradesh,Nandyal,518432,0,1,0,1
4,26-10-2025,Andhra Pradesh,Nandyal,518543,1,0,0,1
...,...,...,...,...,...,...,...,...
999995,26-10-2025,Andhra Pradesh,Mahbubnagar,509207,1,0,0,1
999996,26-10-2025,Andhra Pradesh,Medak,502220,1,0,0,1
999997,26-10-2025,Andhra Pradesh,Medak,502256,0,1,0,1
999998,26-10-2025,Andhra Pradesh,Medak,502286,1,0,0,1
999999,26-10-2025,Andhra Pradesh,N. T. R,521402,1,0,0,1

In [18]:
data_enrollment["total"] = data_enrollment["age_0_5"] + data_enrollment["age_5_17"]

In [19]:
data_enrollment

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,total
0,26-10-2025,Andhra Pradesh,Nalgonda,508004,0,1,0,1
1,26-10-2025,Andhra Pradesh,Nalgonda,508238,1,0,0,1
2,26-10-2025,Andhra Pradesh,Nalgonda,508278,1,0,0,1
3,26-10-2025,Andhra Pradesh,Nandyal,518432,0,1,0,1
4,26-10-2025,Andhra Pradesh,Nandyal,518543,1,0,0,1
...,...,...,...,...,...,...,...,...
999995,26-10-2025,Andhra Pradesh,Mahbubnagar,509207,1,0,0,1
999996,26-10-2025,Andhra Pradesh,Medak,502220,1,0,0,1
999997,26-10-2025,Andhra Pradesh,Medak,502256,0,1,0,1
999998,26-10-2025,Andhra Pradesh,Medak,502286,1,0,0,1
999999,26-10-2025,Andhra Pradesh,N. T. R,521402,1,0,0,1

In [36]:
df_demo

,date,state,district,pincode,demo_age_5_17,demo_age_17_,total,total2,total3,demo_total
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,578,49,578,578
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,397,22,397,397
2,01-03-2025,Gujarat,Rajkot,360006,65,765,830,65,830,830
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,338,24,338,338
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,830,45,830,830
...,...,...,...,...,...,...,...,...,...,...
2071693,29-12-2025,West Bengal,West Midnapore,721212,0,12,12,0,12,12
2071694,29-12-2025,West Bengal,West Midnapore,721420,0,1,1,0,1,1
2071695,29-12-2025,West Bengal,West Midnapore,721424,0,5,5,0,5,5
2071696,29-12-2025,West Bengal,West Midnapore,721426,0,3,3,0,3,3
2071697,29-12-2025,West Bengal,hooghly,712701,0,1,1,0,1,1

In [38]:
cols = ["date", "district", "total"]

df1_small = df[cols]
df2_small = data_enrollment[cols]
df3_small = df_demo[cols]

In [39]:
combined_df = pd.concat(
    [df1_small, df2_small, df3_small],
    ignore_index=True
)

In [40]:
combined_df

                        date        district  total
0        2025-03-01 00:00:00    mahendragarh    857
1        2025-03-01 00:00:00       madhepura    513
2        2025-03-01 00:00:00           punch   1734
3        2025-03-01 00:00:00         bhojpur   1236
4        2025-03-01 00:00:00         madurai   1086
...                      ...             ...    ...
4932801           29-12-2025  West Midnapore     12
4932802           29-12-2025  West Midnapore      1
4932803           29-12-2025  West Midnapore      5
4932804           29-12-2025  West Midnapore      3
4932805           29-12-2025         hooghly      1

[4932806 rows x 3 columns]

In [43]:

final_df = (
    combined_df
    .groupby(["date", "district"], as_index=False)
    ["total"]
    .max()
)